Page({

  /**
   * 页面的初始数据
   */
  data: {
    publicData:[
      { 'time': '2019', 'content': '这是寄往2019的信这是寄往2019的信这是寄往2019的信这是寄往2019的信这是寄往2019的信这是寄往2019的信这是寄往2019的信这是寄往2019的信这是寄往2019的信这是寄往2019的信这是寄往2019的信这是寄往2019的信这是寄往2019的信这是寄往2019的信这是寄往2019的信这是寄往2019的信这是寄往2019的信这是寄往2019的信这是寄往2019的信这是寄往2019的信这是寄往2019的信这是寄往2019的信这是寄往2019的信这是寄往2019的信这是寄往2019的信这是寄往2019的信这是寄往2019的信这是寄往2019的信这是寄往2019的信这是寄往2019的信这是寄往2019的信这是寄往2019的信这是寄往2019的信这是寄往2019的信这是寄往2019的信这是寄往2019的信这是寄往2019的信这是寄往2019的信这是寄往2019的信这是寄往2019的信' },
      { 'time': '2020', 'content': '这是寄往2020的信这是寄往2020的信这是寄往2020的信这是寄往2020的信这是寄往2020的信这是寄往2020的信' },
      { 'time': '2021', 'content': '这是寄往2021的信这是寄往2021的信这是寄往2021的信这是寄往2021的信这是寄往2021的信这是寄往2021的信' },
      { 'time': '2022', 'content': '这是寄往2022的信这是寄往2022的信这是寄往2022的信这是寄往2022的信这是寄往2022的信这是寄往2022的信' },
    ],
    amount: '20'
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
    
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
    
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
    
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
    
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
    
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
    
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
    
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
    
  }
})